WcfServicesApp/WcfServicesApp.WcfServiceLib/XML_Soap_Body.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <GUI_DON_HANG xmlns="http://tempuri.org/">
            <ds>
                <NewDataSet>
                    <Table1>
                        <STATUS>1</STATUS>
                        <ORDER_NO>1</ORDER_NO>
                        <ORDER_DAT></ORDER_DAT>
                        <ORDER_TIM>1</ORDER_TIM>
                        <ORDER_OPTR>1</ORDER_OPTR>
                        <EXP_RCV_DAT>1</EXP_RCV_DAT>
                        <WH_CODE>1</WH_CODE>
                        <TYPE_CODE>1</TYPE_CODE>
                        <BP_CODE>1</BP_CODE>
                        <TOTAL>1</TOTAL>
                        <APV_DAT>1</APV_DAT>
                        <APV_TIM>1</APV_TIM>
                        <APV_OPTR>1</APV_OPTR>
                        <DCS_DAT>1</DCS_DAT>
                        <DCS_TIM>1</DCS_TIM>
                        <DCS_OPTR>1</DCS_OPTR>
                        <RMRK1>1</RMRK1>
                        <RMRK2>1</RMRK2>
                        <REASON>1</REASON>
                        <ACTFLG>1</ACTFLG>
                        <CTDUSR>1</CTDUSR>
                        <CTDWKS>1</CTDWKS>
                        <CTDPGM>1</CTDPGM>
                        <CTDDTM>1</CTDDTM>
                        <MDFUSR>1</MDFUSR>
                        <MDFWKS>1</MDFWKS>
                        <MDFPGM>1</MDFPGM>
                        <LSTMDF>1</LSTMDF>
                    </Table1>
                    <Table2>
                        <PART_NO>1</PART_NO>
                        <ORDER_NO>1</ORDER_NO>
                        <LINE_NO>1</LINE_NO>
                        <STATUS>1</STATUS>
                        <BO_FLAG>1</BO_FLAG>
                        <QTY>1</QTY>
                        <PRICE>1</PRICE>
                        <LINE_TOTAL>1</LINE_TOTAL>
                        <ALL_QTY>1</ALL_QTY>
                        <DLV_QTY>1</DLV_QTY>
                        <OO_QTY>1</OO_QTY>
                        <STOCK_QTY>1</STOCK_QTY>
                        <CANCEL_QTY>1</CANCEL_QTY>
                        <FNO>1</FNO>
                        <REASON>1</REASON>
                        <ACTFLG>1</ACTFLG>
                        <CTDUSR>1</CTDUSR>
                        <CTDWKS>1</CTDWKS>
                        <CTDPGM>1</CTDPGM>
                        <CTDDTM>1</CTDDTM>
                        <MDFUSR>1</MDFUSR>
                        <MDFWKS>1</MDFWKS>
                        <MDFPGM>1</MDFPGM>
                        <LSTMDF></LSTMDF>
                    </Table2>
                </NewDataSet>
            </ds>
            <strUSR>35003</strUSR>
            <strWKS>35003</strWKS>
            <strPGM>Test</strPGM>
            <strUsername>35003</strUsername>
            <strPassword>Honda@2018</strPassword>
            <strDEALER_CODE>35003</strDEALER_CODE>
            <strErr></strErr>
            <showScreen>0</showScreen>
        </GUI_DON_HANG>
    </soap:Body>
</soap:Envelope>